Белгипрозем_2017/src/Catalogs/ПрофилиНастроекКриптографии/ПрофилиНастроекКриптографии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПрофилиНастроекКриптографии</name>
  <attributes>
    <name>ПровайдерЭП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПровайдераЭП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПодписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмХеширования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмШифрования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПутиМодулейКриптографииСерверовLinux</name>
    <attributes>
      <name>ИмяКомпьютера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПутьМодуляКриптографии</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Белгипрозем_2017/src/CommonModules/ЭлектроннаяПодписьПовтИсп/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Электронная подпись"
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Путь модуля криптографии для текущего компьютера.
Функция ПутьМодуляКриптографии(ПрофильНастроекКриптографии = Неопределено) Экспорт
	
	ТипПлатформыСервера = ОбщегоНазначенияПовтИсп.ТипПлатформыСервера();
	
	Если ТипПлатформыСервера = ТипПлатформы.Windows_x86 ИЛИ ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда
		Возврат ""; // в Windows путь модуля криптографии не нужен
	КонецЕсли;
	
	Если ПрофильНастроекКриптографии = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	ИмяКомпьютера = ИмяКомпьютера();
	ПутьМодуля = "";
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПрофилиНастроекКриптографии.ПутиМодулейКриптографииСерверовLinux.(
		|		ПутьМодуляКриптографии
		|	)
		|ИЗ
		|	Справочник.ПрофилиНастроекКриптографии КАК ПрофилиНастроекКриптографии
		|ГДЕ
		|	ПрофилиНастроекКриптографии.Ссылка = &ПрофильНастроекКриптографии
		|	И ПрофилиНастроекКриптографии.ПутиМодулейКриптографииСерверовLinux.ИмяКомпьютера = &ИмяКомпьютера";
	Запрос.УстановитьПараметр("ИмяКомпьютера", ИмяКомпьютера);
	Запрос.УстановитьПараметр("ПрофильНастроекКриптографии", ПрофильНастроекКриптографии);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПутьМодуля = Выборка.ПутьМодуляКриптографии;
	КонецЕсли;
	
	Возврат ПутьМодуля;
	
КонецФункции

#КонецОбласти
